saved_forms/vidya-rel-550-BOGO-$20.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
      <RequestDateTime xsi:nil="true"></RequestDateTime>
      <StoreID xsi:nil="true"></StoreID>
      <RequestType>LIVE</RequestType>
      <orderRequest>
        <OrderID>1234</OrderID>
        <OrderDate>03/18/2009 9:00</OrderDate>
        <Channel>POS</Channel>
        <Brand>Gap</Brand>
        <Market>USA</Market>
        <OrderLineItems>
          <SequenceNumber>0</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1230005043</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>01</ItemClassNumber>
            <ItemSubClassNumber>06</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>19.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>1</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1231005043</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>01</ItemClassNumber>
            <ItemSubClassNumber>06</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>50</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>2</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>12300012002</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>00</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>33.97</NetPrice>
            <PriceType>MARKDOWN</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>3</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>12300012002</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>00</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>33.97</NetPrice>
            <PriceType>MARKDOWN</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>4</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1230005043</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>01</ItemClassNumber>
            <ItemSubClassNumber>06</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>19.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>5</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1231005043</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>01</ItemClassNumber>
            <ItemSubClassNumber>06</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>50</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>6</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>12300012002</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>122</ItemDepartmentNumber>
            <ItemClassNumber>00</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>33.97</NetPrice>
            <PriceType>MARKDOWN</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <Promotions>
          <SequenceNumber>0</SequenceNumber>
          <PromotionCode>D6MP2JCRLTDY</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
      </orderRequest>
    </n1:DiscountServiceRequest>
  </env:Body>
</env:Envelope>