saved_forms/anna-request4.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
	        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		  <env:Body>
			      <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
				            <RequestDateTime xsi:nil="true"></RequestDateTime>
					          <StoreID xsi:nil="true"></StoreID>
						        <RequestType>LIVE</RequestType>
							      <orderRequest>
								              <OrderID>1234</OrderID>
									              <OrderDate>06/01/2009 14:02</OrderDate>
										              <Channel>POS</Channel>
											              <Brand>Gap</Brand>
												              <Market>CANADA</Market>
													              <OrderLineItems>
															                <SequenceNumber>0</SequenceNumber>
																	          <Product>
																			              <Brand>Gap</Brand>
																				                  <Sku>1230005003</Sku>
																						              <ItemCorpNumber>01</ItemCorpNumber>
																							                  <ItemCompanyNumber>1</ItemCompanyNumber>
																									              <ItemDivisionNumber>16</ItemDivisionNumber>
																										                  <ItemDepartmentNumber>163</ItemDepartmentNumber>
																												              <ItemClassNumber>15</ItemClassNumber>
																													                  <ItemSubClassNumber>00</ItemSubClassNumber>
																															              <MerchandiseType>7</MerchandiseType>
																																                  <StyleColor>497747001</StyleColor>
																																		            </Product>
																																			              <Price>
																																					                  <NetPrice>50</NetPrice>
																																							              <PriceType>REGULAR</PriceType>
																																								                </Price>
																																										          <Quantity>1</Quantity>
																																											          </OrderLineItems>
																																												          <OrderLineItems>
																																														            <SequenceNumber>1</SequenceNumber>
																																															              <Product>
																																																	                  <Brand>Gap</Brand>
																																																			              <Sku>3127494512</Sku>
																																																				                  <MerchandiseType>7</MerchandiseType>
																																																						              <StyleColor>876096051</StyleColor>
																																																							                </Product>
																																																									          <Price>
																																																											              <NetPrice>19.99</NetPrice>
																																																												                  <PriceType>REGULAR</PriceType>
																																																														            </Price>
																																																															              <Quantity>1</Quantity>
																																																																              </OrderLineItems>
																																																																	              <Promotions>
																																																																			                <SequenceNumber>0</SequenceNumber>
																																																																					          <PromotionCode>10P50GLIX4</PromotionCode>
																																																																						            <ReceiptMessages></ReceiptMessages>
																																																																							              <PromoUsages></PromoUsages>
																																																																								                <QualifyingTenders xsi:nil="true"></QualifyingTenders>
																																																																										        </Promotions>
																																																																											      </orderRequest>
																																																																											          </n1:DiscountServiceRequest>
																																																																												    </env:Body>
																																																																											    </env:Envelope>
